[{"categories":null,"contents":"I never planned to become a DevOps engineer.\nIn fact, I started my career over a decade ago as a backend developer, building APIs and systems for U.S. clients. I spent six years immersed in clean code, business logic, and scaling server-side applications. But as time passed, I realized that writing code was only part of building reliable software — the real magic (and sometimes the chaos) happened after deployment.\nThat\u0026rsquo;s when I made the shift.\n💡 What Pulled Me into DevOps? Around five years ago, I found myself constantly stepping in to troubleshoot CI failures, misconfigured servers, and release rollbacks. I realized that developer efficiency, observability, and infrastructure automation were areas I naturally gravitated toward.\nSo I leaned in.\nI learned tools like Terraform, Kubernetes, Helm, GitLab CI/CD, Prometheus, Grafana, AWS, and Crossplane. What started as a side responsibility eventually became a full transition into DevOps and Site Reliability Engineering (SRE).\n🔧 What I\u0026rsquo;ve Built So Far Set up GitLab CI/CD pipelines that automatically build, test, and deploy microservices to Kubernetes clusters. Used ArgoCD and GitOps principles to manage app lifecycles across staging and production environments. Implemented ELK and Prometheus/Grafana stacks for observability and proactive monitoring. Migrated infrastructure from manual provisioning to Terraform-as-code, making environments reproducible and consistent. Introduced Crossplane for dynamic provisioning of AWS resources using Kubernetes-native workflows. Each of these projects taught me one big lesson: automation is not about writing scripts — it\u0026rsquo;s about building trust in systems.\n⚠️ The Hard Lessons This journey wasn’t smooth. I’ve:\nDebugged broken Helm deployments under pressure Misconfigured resource limits that caused outages Accidentally triggered large-scale restarts through a faulty GitLab pipeline Dealt with legacy systems with no documentation But every failure refined my approach. DevOps isn’t about perfection — it’s about continuous learning, recovery, and resilience.\n🌱 Where I\u0026rsquo;m Headed Next Right now, I’m focused on:\nDeepening my expertise in Kubernetes security and cost optimization Writing infrastructure design documents and improving developer onboarding Exploring OpenTelemetry and Crossplane Providers written in Go Sharing more of what I’ve learned with the community (starting with this blog!) I’m also actively looking for a new role where I can help teams build reliable, scalable, and observable systems, while staying deeply aligned with DevOps best practices.\n🙏 Why I’m Starting This Blog I want to document and share:\nReal-world DevOps problems and how I solve them Lessons from working across different tools and teams Personal reflections as I grow as a platform/SRE engineer If you\u0026rsquo;re a developer transitioning into DevOps, a fellow SRE, or someone navigating tech career shifts — I hope this space gives you insight, reassurance, or even a helpful tip.\nLet’s learn together.\nSamskrutha Swamy\nDevOps | SRE | Kubernetes Enthusiast\n📍 Berlin, Germany\n💬 Let me know what topics you\u0026rsquo;d like to read about next. You can reach out to me on LinkedIn or drop a comment on the post.\n","permalink":"http://localhost:1313/blog/devops-journey/","tags":["Devops","general"],"title":"Devops Journey"},{"categories":null,"contents":"Senior DevOps Engineer At Perfood GmbH, I led the development of a robust, production-grade Kubernetes platform on Google Cloud Platform (GCP) to support our digital health products. I designed and implemented GitOps-driven infrastructure using ArgoCD, empowering teams to deploy confidently with consistency and traceability.\nMy work focused on infrastructure automation using Terraform and Crossplane, secure secret management with Vault, and observability through a fully integrated stack: Prometheus, Grafana, Loki, and Thanos. I also architected automated backup strategies using Kubernetes cron jobs and GCS buckets, ensuring resilience and recoverability for both PostgreSQL and application data.\nOne of my key achievements was migrating our analytics platform (Matomo) into Kubernetes, improving scalability, database security, and backup automation. I collaborated with cross-functional teams to define SLOs, implement proactive alerting, and streamline deployment pipelines in GitLab CI/CD.\nThis role deepened my experience in building developer-centric cloud platforms in regulated environments, and strengthened my expertise in GCP-native DevOps and platform engineering.\n","permalink":"http://localhost:1313/experience/job-3/","tags":null,"title":""},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/jenkins/","tags":null,"title":"Jenkins"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/gcp/","tags":null,"title":"GCP"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/elk/","tags":null,"title":"elk"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/kubernetes/","tags":null,"title":"Kubernetes"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/docker/","tags":null,"title":"Docker"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/aws/","tags":null,"title":"AWS"},{"categories":null,"contents":"","permalink":"http://localhost:1313/client-work/grafana/","tags":null,"title":"Grafana"},{"categories":null,"contents":"","permalink":"http://localhost:1313/education/high-school/","tags":null,"title":"Visvesvaraya Technological University"},{"categories":null,"contents":"","permalink":"http://localhost:1313/education/university-of-life/","tags":null,"title":"Western Michigan University"},{"categories":null,"contents":"Lead DevOps Engineer At Hexad GmbH, I played a key role in designing, building, and maintaining scalable, secure DevOps platforms for multiple client-facing applications. As the Lead DevOps Engineer, I led the DevOps transformation efforts within cross-functional teams, aligning infrastructure automation with agile delivery processes.\nI was responsible for architecting and implementing CI/CD pipelines using GitLab CI, enabling faster and more reliable delivery cycles across development, staging, and production environments. My expertise in Terraform, Helm, and Kubernetes (EKS) allowed us to standardize infrastructure provisioning and application deployments across projects, significantly reducing configuration drift and manual errors.\nOne of my most impactful contributions was leading the adoption of GitOps with ArgoCD, which enhanced deployment visibility, rollback capabilities, and auditability for both internal and external stakeholders. I also implemented centralized monitoring and observability stacks using Prometheus, Grafana, Loki, and ELK, providing real-time insight into system health and application performance.\nAdditionally, I established best practices for cloud security and cost optimization on AWS, and mentored DevOps engineers on infrastructure-as-code, secrets management (Vault), and production incident handling. This role solidified my expertise in building developer-centric, resilient platforms and helped position Hexad as a DevOps-driven organization.\n","permalink":"http://localhost:1313/experience/job-2/","tags":null,"title":""},{"categories":null,"contents":"Senior Software Engineer This role marked the foundation of my professional growth in software engineering. During my tenure at HCL Global Systems Inc., I worked on full-stack development for enterprise applications, collaborating closely with cross-functional teams across design, QA, and infrastructure.\nI was responsible for building and maintaining core modules for web-based systems used by Fortune 500 clients, ensuring high availability and performance. My time at HCL also gave me exposure to version control workflows, RESTful API integration, and real-world agile methodologies, which shaped my collaborative and structured approach to development.\nOne of my key contributions was the development of an internal documentation and knowledge-sharing platform, which improved onboarding and cross-team communication. I also built automated testing scripts that reduced QA cycles by 25%, boosting overall release efficiency.\nBeyond my technical contributions, I actively mentored junior developers and participated in regular code reviews, cultivating a strong culture of continuous improvement and technical ownership.\nThis role laid the groundwork for my transition from backend development into platform engineering, setting the stage for my future specialization in DevOps and infrastructure automation.\n","permalink":"http://localhost:1313/experience/job-1/","tags":null,"title":""},{"categories":null,"contents":" Reach out Send message My phone +49 1521 0958058 My mail samskruthaswamy@t-online.de My location 📍 Berlin, Germany Stay updated Subscribe Thank you for subscribing! Something went wrong, please try again. We respect your privacy and won\u0026#39;t share your data. ","permalink":"http://localhost:1313/footer/footer/","tags":null,"title":"Footer"},{"categories":null,"contents":" Hello, I\u0026#39;m Samskruth. Lead DevOps Engineer Based in Berlin, I specialize in building scalable, secure, and observable cloud-native platforms. I’ve led DevOps transformations in health-tech and enterprise environments, empowering teams with infrastructure-as-code, GitOps, and production-grade Kubernetes systems.With over a decade of experience — including six years as a backend developer — I bring a product-minded, automation-first approach to platform engineering. From Terraform to Crossplane, from GitLab CI/CD to ArgoCD, I design systems that developers love and operations teams trust.Whether mentoring engineers or optimizing cloud costs, I care deeply about building platforms that balance speed, reliability, and simplicity.Welcome to my digital home — where I write about DevOps, developer productivity, and building a meaningful, well-balanced life. Contact Me About Me I'm a Berlin-based DevOps engineer with over 11 years of IT experience. I began as a backend developer, working across diverse domains, before transitioning into DevOps to pursue my passion for automation and systems design. My mission is to make infrastructure reliable, observable, and developer-friendly.Outside of tech, I'm a dedicated family man and spiritual learner, striving to build a life that's not only efficient but meaningful. Download My CV Formal Education 2008-2012 Visvesvaraya Technological University Bachelor of Engineering (BE), Computer Science \u0026amp; Engineering 2012-2014 Western Michigan University Master of Science (MS), Computer Science Professional Experience 2024–now Senior DevOps Engineer Perfood GmbH. Berlin, Germany Senior DevOps Engineer At Perfood GmbH, I led the development of a robust, production-grade Kubernetes platform on Google Cloud Platform (GCP) to support our digital health products. I designed and implemented GitOps-driven infrastructure using ArgoCD, empowering teams to deploy confidently with consistency and traceability. My work focused on infrastructure automation using Terraform and Crossplane, secure secret management with Vault, and observability through a fully integrated stack: Prometheus, Grafana, Loki, and Thanos. I also architected automated backup strategies using Kubernetes cron jobs and GCS buckets, ensuring resilience and recoverability for both PostgreSQL and application data. One of my key achievements was migrating our analytics platform (Matomo) into Kubernetes, improving scalability, database security, and backup automation. I collaborated with cross-functional teams to define SLOs, implement proactive alerting, and streamline deployment pipelines in GitLab CI/CD. This role deepened my experience in building developer-centric cloud platforms in regulated environments, and strengthened my expertise in GCP-native DevOps and platform engineering. 2019–2024 Lead DevOps Engineer Hexad GmbH. Berlin, Germany Lead DevOps Engineer At Hexad GmbH, I played a key role in designing, building, and maintaining scalable, secure DevOps platforms for multiple client-facing applications. As the Lead DevOps Engineer, I led the DevOps transformation efforts within cross-functional teams, aligning infrastructure automation with agile delivery processes. I was responsible for architecting and implementing CI/CD pipelines using GitLab CI, enabling faster and more reliable delivery cycles across development, staging, and production environments. My expertise in Terraform, Helm, and Kubernetes (EKS) allowed us to standardize infrastructure provisioning and application deployments across projects, significantly reducing configuration drift and manual errors. One of my most impactful contributions was leading the adoption of GitOps with ArgoCD, which enhanced deployment visibility, rollback capabilities, and auditability for both internal and external stakeholders. I also implemented centralized monitoring and observability stacks using Prometheus, Grafana, Loki, and ELK, providing real-time insight into system health and application performance. Additionally, I established best practices for cloud security and cost optimization on AWS, and mentored DevOps engineers on infrastructure-as-code, secrets management (Vault), and production incident handling. This role solidified my expertise in building developer-centric, resilient platforms and helped position Hexad as a DevOps-driven organization. 2014–2019 Senior Software Engineer HCL Global Systems INC. Farmington Hills, Michigan Senior Software Engineer This role marked the foundation of my professional growth in software engineering. During my tenure at HCL Global Systems Inc., I worked on full-stack development for enterprise applications, collaborating closely with cross-functional teams across design, QA, and infrastructure. I was responsible for building and maintaining core modules for web-based systems used by Fortune 500 clients, ensuring high availability and performance. My time at HCL also gave me exposure to version control workflows, RESTful API integration, and real-world agile methodologies, which shaped my collaborative and structured approach to development. One of my key contributions was the development of an internal documentation and knowledge-sharing platform, which improved onboarding and cross-team communication. I also built automated testing scripts that reduced QA cycles by 25%, boosting overall release efficiency. Beyond my technical contributions, I actively mentored junior developers and participated in regular code reviews, cultivating a strong culture of continuous improvement and technical ownership. This role laid the groundwork for my transition from backend development into platform engineering, setting the stage for my future specialization in DevOps and infrastructure automation. From Code to Cloud Across 11+ years in the tech industry, I've built APIs, deployed microservices, scaled Kubernetes clusters, and automated everything from EC2 provisioning to GitOps pipelines. I'm driven by impact, ownership, and making complex systems easy to manage. LinkedIn Profile My Experience Contact Experience in Depth 2024–now Senior DevOps Engineer Perfood GmbH. Berlin, Germany Senior DevOps Engineer At Perfood GmbH, I led the development of a robust, production-grade Kubernetes platform on Google Cloud Platform (GCP) to support our digital health products. I designed and implemented GitOps-driven infrastructure using ArgoCD, empowering teams to deploy confidently with consistency and traceability.\nMy work focused on infrastructure automation using Terraform and Crossplane, secure secret management with Vault, and observability through a fully integrated stack: Prometheus, Grafana, Loki, and Thanos. I also architected automated backup strategies using Kubernetes cron jobs and GCS buckets, ensuring resilience and recoverability for both PostgreSQL and application data.\nOne of my key achievements was migrating our analytics platform (Matomo) into Kubernetes, improving scalability, database security, and backup automation. I collaborated with cross-functional teams to define SLOs, implement proactive alerting, and streamline deployment pipelines in GitLab CI/CD.\nThis role deepened my experience in building developer-centric cloud platforms in regulated environments, and strengthened my expertise in GCP-native DevOps and platform engineering.\n2019–2024 Lead DevOps Engineer Hexad GmbH. Berlin, Germany Lead DevOps Engineer At Hexad GmbH, I played a key role in designing, building, and maintaining scalable, secure DevOps platforms for multiple client-facing applications. As the Lead DevOps Engineer, I led the DevOps transformation efforts within cross-functional teams, aligning infrastructure automation with agile delivery processes.\nI was responsible for architecting and implementing CI/CD pipelines using GitLab CI, enabling faster and more reliable delivery cycles across development, staging, and production environments. My expertise in Terraform, Helm, and Kubernetes (EKS) allowed us to standardize infrastructure provisioning and application deployments across projects, significantly reducing configuration drift and manual errors.\nOne of my most impactful contributions was leading the adoption of GitOps with ArgoCD, which enhanced deployment visibility, rollback capabilities, and auditability for both internal and external stakeholders. I also implemented centralized monitoring and observability stacks using Prometheus, Grafana, Loki, and ELK, providing real-time insight into system health and application performance.\nAdditionally, I established best practices for cloud security and cost optimization on AWS, and mentored DevOps engineers on infrastructure-as-code, secrets management (Vault), and production incident handling. This role solidified my expertise in building developer-centric, resilient platforms and helped position Hexad as a DevOps-driven organization.\n2014–2019 Senior Software Engineer HCL Global Systems INC. Farmington Hills, Michigan Senior Software Engineer This role marked the foundation of my professional growth in software engineering. During my tenure at HCL Global Systems Inc., I worked on full-stack development for enterprise applications, collaborating closely with cross-functional teams across design, QA, and infrastructure.\nI was responsible for building and maintaining core modules for web-based systems used by Fortune 500 clients, ensuring high availability and performance. My time at HCL also gave me exposure to version control workflows, RESTful API integration, and real-world agile methodologies, which shaped my collaborative and structured approach to development.\nOne of my key contributions was the development of an internal documentation and knowledge-sharing platform, which improved onboarding and cross-team communication. I also built automated testing scripts that reduced QA cycles by 25%, boosting overall release efficiency.\nBeyond my technical contributions, I actively mentored junior developers and participated in regular code reviews, cultivating a strong culture of continuous improvement and technical ownership.\nThis role laid the groundwork for my transition from backend development into platform engineering, setting the stage for my future specialization in DevOps and infrastructure automation.\nSkills \u0026amp; Tools Let’s automate purposefully — and live mindfully. ✨ DevOps is more than tools — it\u0026rsquo;s trust, clarity, and intention. ","permalink":"http://localhost:1313/home/home/","tags":null,"title":"Home"},{"categories":null,"contents":"ℹ This page is a demo of the printer-friendly output of the theme. You can find the source code in the demo repo (https://raw.githubusercontent.com/zetxek/adritian-demo/refs/heads/main/content/cv.md). Try printing it directly from your browser!\nAbout me I am a passionate software engineer with over 10 years of experience building web applications and distributed systems. My expertise spans full-stack development, cloud architecture, and leading engineering teams to deliver impactful solutions. I thrive on solving complex technical challenges while mentoring others and fostering a collaborative engineering culture.\nThroughout my career, I\u0026rsquo;ve focused on creating scalable, maintainable software using modern technologies and best practices. I\u0026rsquo;m particularly interested in distributed systems, performance optimization, and building resilient architectures. When I\u0026rsquo;m not coding, I enjoy contributing to open source projects and sharing knowledge through technical writing and speaking at conferences.\nExperience 2024–now Senior DevOps Engineer Perfood GmbH. Berlin, Germany Senior DevOps Engineer At Perfood GmbH, I led the development of a robust, production-grade Kubernetes platform on Google Cloud Platform (GCP) to support our digital health products. I designed and implemented GitOps-driven infrastructure using ArgoCD, empowering teams to deploy confidently with consistency and traceability.\nMy work focused on infrastructure automation using Terraform and Crossplane, secure secret management with Vault, and observability through a fully integrated stack: Prometheus, Grafana, Loki, and Thanos. I also architected automated backup strategies using Kubernetes cron jobs and GCS buckets, ensuring resilience and recoverability for both PostgreSQL and application data.\nOne of my key achievements was migrating our analytics platform (Matomo) into Kubernetes, improving scalability, database security, and backup automation. I collaborated with cross-functional teams to define SLOs, implement proactive alerting, and streamline deployment pipelines in GitLab CI/CD.\nThis role deepened my experience in building developer-centric cloud platforms in regulated environments, and strengthened my expertise in GCP-native DevOps and platform engineering.\n2019–2024 Lead DevOps Engineer Hexad GmbH. Berlin, Germany Lead DevOps Engineer At Hexad GmbH, I played a key role in designing, building, and maintaining scalable, secure DevOps platforms for multiple client-facing applications. As the Lead DevOps Engineer, I led the DevOps transformation efforts within cross-functional teams, aligning infrastructure automation with agile delivery processes.\nI was responsible for architecting and implementing CI/CD pipelines using GitLab CI, enabling faster and more reliable delivery cycles across development, staging, and production environments. My expertise in Terraform, Helm, and Kubernetes (EKS) allowed us to standardize infrastructure provisioning and application deployments across projects, significantly reducing configuration drift and manual errors.\nOne of my most impactful contributions was leading the adoption of GitOps with ArgoCD, which enhanced deployment visibility, rollback capabilities, and auditability for both internal and external stakeholders. I also implemented centralized monitoring and observability stacks using Prometheus, Grafana, Loki, and ELK, providing real-time insight into system health and application performance.\nAdditionally, I established best practices for cloud security and cost optimization on AWS, and mentored DevOps engineers on infrastructure-as-code, secrets management (Vault), and production incident handling. This role solidified my expertise in building developer-centric, resilient platforms and helped position Hexad as a DevOps-driven organization.\n2014–2019 Senior Software Engineer HCL Global Systems INC. Farmington Hills, Michigan Senior Software Engineer This role marked the foundation of my professional growth in software engineering. During my tenure at HCL Global Systems Inc., I worked on full-stack development for enterprise applications, collaborating closely with cross-functional teams across design, QA, and infrastructure.\nI was responsible for building and maintaining core modules for web-based systems used by Fortune 500 clients, ensuring high availability and performance. My time at HCL also gave me exposure to version control workflows, RESTful API integration, and real-world agile methodologies, which shaped my collaborative and structured approach to development.\nOne of my key contributions was the development of an internal documentation and knowledge-sharing platform, which improved onboarding and cross-team communication. I also built automated testing scripts that reduced QA cycles by 25%, boosting overall release efficiency.\nBeyond my technical contributions, I actively mentored junior developers and participated in regular code reviews, cultivating a strong culture of continuous improvement and technical ownership.\nThis role laid the groundwork for my transition from backend development into platform engineering, setting the stage for my future specialization in DevOps and infrastructure automation.\nEducation 2008-2012 Visvesvaraya Technological University Bachelor of Engineering (BE), Computer Science \u0026amp; Engineering 2012-2014 Western Michigan University Master of Science (MS), Computer Science ","permalink":"http://localhost:1313/cv/","tags":null,"title":"Printable CV"},{"categories":null,"contents":"","permalink":"http://localhost:1313/search/","tags":null,"title":"Search"}]